<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"fa62173345e78c9fecfdbf3e4ef8afdf1df0ca95938bc4dbb2954d83ae5001cc","plan_job_ref":"Job Test plan target and replace #322 at https://github.com/dflook/terraform-github-actions/actions/runs/4295140085","plan_hash":"48b6132b54d5ec12278ac8c72a77ccfdc8f2d5c636e78b2ae3355b3340e897ce","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "5BSVhKL1N7" -> (known after apply)
  ~ foreach = "z5gUIvQmjg" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #322](https://github.com/dflook/terraform-github-actions/actions/runs/4295140085)